Model: "model_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 8, 8, 64)          9472      
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 4, 4, 32)          51232     
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 4, 2, 16)          528       
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 4, 2, 8)           1160      
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 4, 2, 3)           219       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 4, 2, 3)           84        
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 4, 2, 8)           224       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 4, 4, 16)          144       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 8, 8, 32)          12832     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 52s 595us/step - loss: 0.0096
Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 8, 8, 64)          9472      
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 4, 4, 32)          51232     
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 4, 4, 16)          528       
_________________________________________________________________
conv2d_64 (Conv2D)           (None, 4, 4, 8)           1160      
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 4, 4, 3)           219       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 4, 4, 3)           84        
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 4, 4, 8)           224       
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 4, 4, 16)          144       
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 8, 8, 32)          12832     
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 48s 544us/step - loss: 0.0080
Model: "model_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_8 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 8, 8, 64)          9472      
_________________________________________________________________
conv2d_67 (Conv2D)           (None, 8, 4, 32)          51232     
_________________________________________________________________
conv2d_68 (Conv2D)           (None, 8, 4, 16)          528       
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 8, 4, 8)           1160      
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 8, 4, 3)           219       
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 8, 4, 3)           84        
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 8, 4, 8)           224       
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 8, 4, 16)          144       
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 8, 8, 32)          12832     
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 59s 669us/step - loss: 0.0070
Model: "model_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 8, 8, 64)          9472      
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 8, 8, 32)          51232     
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 8, 8, 16)          528       
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 8, 8, 8)           1160      
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 8, 8, 3)           219       
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 8, 8, 3)           84        
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 8, 8, 8)           224       
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 8, 8, 16)          144       
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 8, 8, 32)          12832     
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 49s 560us/step - loss: 0.0056
Model: "model_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_10 (InputLayer)        (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_76 (Conv2D)           (None, 16, 8, 64)         9472      
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 16, 8, 32)         51232     
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 16, 8, 16)         528       
_________________________________________________________________
conv2d_79 (Conv2D)           (None, 16, 8, 8)          1160      
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 16, 8, 3)          219       
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 16, 8, 3)          84        
_________________________________________________________________
conv2d_transpose_26 (Conv2DT (None, 16, 8, 8)          224       
_________________________________________________________________
conv2d_transpose_27 (Conv2DT (None, 16, 8, 16)         144       
_________________________________________________________________
conv2d_transpose_28 (Conv2DT (None, 16, 8, 32)         12832     
_________________________________________________________________
conv2d_transpose_29 (Conv2DT (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_transpose_30 (Conv2DT (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 71s 812us/step - loss: 0.0035