Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 64)        9472      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          51232     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 16)          528       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 4, 16)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 2, 4, 8)           1160      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 2, 4, 3)           219       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 2, 4, 3)           84        
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 2, 4, 8)           224       
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 4, 4, 8)           0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 4, 4, 16)          144       
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 8, 32)          12832     
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 64s 730us/step - loss: 0.0090
Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 16, 16, 64)        9472      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 8, 8, 32)          51232     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 4, 4, 32)          0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 4, 4, 16)          528       
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 4, 4, 8)           1160      
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 4, 4, 3)           219       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 4, 4, 3)           84        
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 4, 4, 8)           224       
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 4, 4, 16)          144       
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 8, 8, 32)          12832     
_________________________________________________________________
up_sampling2d_5 (UpSampling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 61s 697us/step - loss: 0.0081
Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 16, 16, 64)        9472      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 8, 8, 32)          51232     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 4, 8, 32)          0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 4, 8, 16)          528       
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 4, 8, 8)           1160      
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 4, 8, 3)           219       
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 4, 8, 3)           84        
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 4, 8, 8)           224       
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 4, 8, 16)          144       
_________________________________________________________________
up_sampling2d_6 (UpSampling2 (None, 8, 8, 16)          0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 8, 8, 32)          12832     
_________________________________________________________________
up_sampling2d_7 (UpSampling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 58s 661us/step - loss: 0.0055
Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 16, 16, 64)        9472      
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 8, 8, 64)          0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 8, 8, 32)          51232     
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 8, 8, 16)          528       
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 8, 8, 8)           1160      
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 8, 8, 3)           219       
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 8, 8, 3)           84        
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 8, 8, 8)           224       
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 8, 8, 16)          144       
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 8, 8, 32)          12832     
_________________________________________________________________
up_sampling2d_8 (UpSampling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 57s 649us/step - loss: 0.0042
Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 16, 16, 3)         0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 16, 16, 64)        9472      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 8, 16, 64)         0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 8, 16, 32)         51232     
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 8, 16, 16)         528       
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 8, 16, 8)          1160      
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 8, 16, 3)          219       
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 8, 16, 3)          84        
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 8, 16, 8)          224       
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 8, 16, 16)         144       
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 8, 16, 32)         12832     
_________________________________________________________________
up_sampling2d_9 (UpSampling2 (None, 16, 16, 32)        0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 16, 16, 64)        100416    
_________________________________________________________________
conv2d_55 (Conv2D)           (None, 16, 16, 3)         195       
=================================================================
Total params: 176,506
Trainable params: 176,506
Non-trainable params: 0
_________________________________________________________________
Epoch 1/1
87750/87750 [==============================] - 65s 743us/step - loss: 0.0039